<template>
    <div class="today-body">
        <HeaderCom :title="name">
        </HeaderCom>
         <!-- <div class="p1_02 clearfix width884">
    <h1 class="red">党史上的今天</h1>
    
    
    
   <h2>1967年10月17日　中共中央、国务院等发出《关于按照系统实行革命大联合的通知》</h2><p>1967年10月17日　中共中央、国务院、中央军委、中央文革发出《关于按照系统实行革命大联合的通知》，实际上取消了对全国许多跨行业的群众组织的承认。在此前后，中共中央连续发布有关不准抢夺解放军的武器装备、维护社会治安、确保国家资财和人民群众生活秩序等一系列通知和文件，并采取措施加强保护外国使馆和外国侨民的安全。同时，中央还决定对一些最混乱的省、自治区和重要党政部门实行军事管制，并要求各地造反派停止武斗，开门整风，斗私批修，消除派性。</p><h2>1969年10月17日&nbsp;&nbsp;林彪作出《关于加强战备，防止敌人突然袭击的紧急指示》</h2><p>1969年10月17日  根据毛泽东关于国际形势有可能突然恶化的估计，林彪作出《关于加强战备，防止敌人突然袭击的紧急指示》，要求全军进入紧急战备状态，抓紧武器的生产，指挥班子进入战时指挥位置等。18日，黄永胜等以“林副主席第一个号令”正式下达这个“紧急指示”，引起了各方面的极大震动。</p><h2>1981年10月17日　中共中央、国务院作出《关于广开门路，搞活经济，解决城镇就业问题的若干规定》</h2><p>1981年10月17日　中共中央、国务院作出《关于广开门路，搞活经济，解决城镇就业问题的若干规定》。《规定》指出，城镇青年就业是国民经济中的一个重大问题；今后在调整产业结构的同时，必须着重开辟在集体经济和个体经济中的就业渠道；努力办好城镇集体所有制经济，大力提倡和指导待业青年组织起来，在集体经济单位就业；按照国民经济的需要适当发展城镇劳动者个体经济，增加自谋职业的渠道；要采取积极态度，坚决地迅速地改变那些歧视、限制、打击、并吞集体经济和个体经济的政策措施，代之以引导、鼓励、促进、扶持的政策措施。</p><h2>2006年10月17日&nbsp;&nbsp;以“加强两岸农业合作，实现农业互利互赢”为主题的两岸农业合作论坛在博鳌举行</h2><p>2006年10月17日  由中共中央台湾办公室海研中心与中国国民党国政研究基金会共同举办，以“加强两岸农业合作，实现两岸农业互利互赢”为主题的两岸农业合作论坛在海南博鳌举行。贾庆林和连战分别作了题为《共创两岸农业合作互利双赢的新局面》、《开创两岸互利双赢的农业合作新局面》的演讲。与会人士就“加入WTO后两岸农业合作面临之机遇与挑战”、“当前两岸农业合作模式之探讨”、“两岸农业合作发展之问题与对策”三项议题，进行了广泛而深入的研讨。</p>
  </div> -->
    </div>
</template>

<script>
    import HeaderCom from '@/components/header-Com'
    import xhr from '@/utils/index.js'
    export default {
        components:{
            HeaderCom
        },
        data(){
            return{
                name:'党史上的今天'
            }
        },
        methods:{
            getdata(){
                xhr.get('/proxy/proxy.do?url=http:%2F%2Fcpc.people.com.cn%2FGB%2F64162%2F64165%2F70486%2F70503%2Findex.html')
                .then(res=>{
                    // const p=/^(<div class="p1_02 clearfix width884">){1,1}\d+(<div>)$/gm;
                    // const p=/<div[^>/]*class="p1_02 clearfix width884">(.*?)<\/div>/g;
const a=/<div\sclass="p1_02\sclearfix\swidth884">[\d|\D|\s|\r|\n]{1,}<div>/g;
                    this.data=a.exec(res.data) 
                console.log(res.data)
                console.log(this.data)
                })
            }
        },
        created(){
            this.getdata()
        }
    }
</script>
<style lang="scss" scoped>

</style>
